In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Amit','Amol','Ajit','Ajay'],
    "marks":[91, 90, 78, 89],
    "city":['Jath','Sangola','Sangli','Solapur']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [5]:
  df.to_csv('borthers.csv')

In [6]:
dict1 = {
    "name":['Prashant','Sushant','Amit','Ajay'],
    "marks":[91, 90, 78, 89],
    "city":['Jath','Sangola','Sangli','Solapur']
}

In [7]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [8]:
df = pd.DataFrame(df)

In [9]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [10]:
df = pd.DataFrame(dict1)

In [11]:
df

       name  marks     city
0  Prashant     91     Jath
1   Sushant     90  Sangola
2      Amit     78   Sangli
3      Ajay     89  Solapur

In [12]:
pd.to_csv(df)

AttributeError: module 'pandas' has no attribute 'to_csv'

In [ ]:
df.to_csv('brothers.csv')

In [ ]:
df.to_csv('brothers_index_false.csv', index=False)

In [ ]:
df.head(2)

In [ ]:
df.tail(2)

In [ ]:
df.describe()

In [ ]:
sawant = pd.read_csv('sawant.csv')

In [ ]:
sawant

In [ ]:
sawant

In [ ]:
sawant['Car Speed']]

In [ ]:
sawant = pd.read_csv('sawant.csv')

In [ ]:
sawant

In [ ]:
sawant['CarSpeed']

In [ ]:
sawant['Brand']

In [ ]:
sawant['Brand'][3]

In [ ]:
sawant['Brand'][2]

In [ ]:
sawant['Brand'][2] = 'Tesla'

In [ ]:
sawant

In [ ]:
type(sawant)

In [ ]:
sawant.to_csv('sawant.csv')

In [ ]:
sawant.index

In [ ]:
sawant.index = ['First','Second','Third','Fourth']

In [ ]:
sawant

In [13]:
ser = pd.Series(np.random.rand(34))

In [14]:
ser

0     0.134230
1     0.454341
2     0.447409
3     0.183532
4     0.184344
5     0.605764
6     0.588315
7     0.827056
8     0.031968
9     0.470769
10    0.879079
11    0.761747
12    0.126583
13    0.351787
14    0.660464
15    0.148967
16    0.417413
17    0.920259
18    0.065873
19    0.094871
20    0.268755
21    0.463668
22    0.226869
23    0.400688
24    0.001820
25    0.119071
26    0.582581
27    0.396731
28    0.064199
29    0.120333
30    0.390948
31    0.738521
32    0.917732
33    0.831612
dtype: float64

In [15]:
type(ser)

pandas.core.series.Series

In [16]:
newdf = pd.DataFarme(np.random.rand(334,5), index=np.arange(334))

AttributeError: module 'pandas' has no attribute 'DataFarme'

In [17]:
pd

In [18]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [22]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.482683    0.512865    0.487005    0.514788    0.494921
std      0.288784    0.278653    0.299999    0.281643    0.300081
min      0.001853    0.017412    0.002097    0.006486    0.001496
25%      0.228018    0.281760    0.215041    0.270500    0.213325
50%      0.473479    0.506875    0.482140    0.520826    0.504788
75%      0.711319    0.755794    0.748600    0.761982    0.762174
max      0.999697    0.995831    0.999803    0.993417    0.999905

In [23]:
type(newdf)

pandas.core.frame.DataFrame

In [25]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [26]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [27]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [28]:
newdf.to_numpy()

array([[0.22712006, 0.1587763 , 0.58280008, 0.97677601, 0.93577188],
       [0.46458472, 0.42582835, 0.17438752, 0.3428609 , 0.24375988],
       [0.32017355, 0.26061419, 0.97332354, 0.56741528, 0.75784848],
       ...,
       [0.35486639, 0.08336012, 0.72269863, 0.61448547, 0.84424938],
       [0.93484806, 0.74666755, 0.84394273, 0.8854725 , 0.62313052],
       [0.8840616 , 0.32358908, 0.38771675, 0.52365523, 0.17394964]])

In [29]:
type(newdf)

pandas.core.frame.DataFrame

In [30]:
newdf

            0         1         2         3         4
0    0.227120  0.158776  0.582800  0.976776  0.935772
1    0.464585  0.425828  0.174388  0.342861  0.243760
2    0.320174  0.260614  0.973324  0.567415  0.757848
3    0.341247  0.569940  0.366893  0.892741  0.586503
4    0.894240  0.975039  0.302874  0.576635  0.523117
..        ...       ...       ...       ...       ...
329  0.686348  0.269655  0.386175  0.495520  0.589684
330  0.763125  0.246915  0.326172  0.406805  0.022943
331  0.354866  0.083360  0.722699  0.614485  0.844249
332  0.934848  0.746668  0.843943  0.885472  0.623131
333  0.884062  0.323589  0.387717  0.523655  0.173950

[334 rows x 5 columns]

In [31]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.227120,0.464585,0.320174,0.341247,0.894240,0.289646,0.831494,0.472489,0.028671,0.731561,...,0.432007,0.790109,0.459532,0.389793,0.258550,0.686348,0.763125,0.354866,0.934848,0.884062
1,0.158776,0.425828,0.260614,0.569940,0.975039,0.175056,0.807553,0.688161,0.191519,0.879970,...,0.829794,0.932980,0.105681,0.432963,0.120575,0.269655,0.246915,0.083360,0.746668,0.323589
2,0.582800,0.174388,0.973324,0.366893,0.302874,0.300442,0.134357,0.611478,0.047662,0.542546,...,0.310018,0.224580,0.866224,0.359733,0.669169,0.386175,0.326172,0.722699,0.843943,0.387717
3,0.976776,0.342861,0.567415,0.892741,0.576635,0.706429,0.608440,0.797664,0.659239,0.110929,...,0.740125,0.435868,0.052689,0.394609,0.376014,0.495520,0.406805,0.614485,0.885472,0.523655
4,0.935772,0.243760,0.757848,0.586503,0.523117,0.996730,0.269491,0.263491,0.813684,0.498705,...,0.761003,0.168899,0.833395,0.261633,0.717611,0.589684,0.022943,0.844249,0.623131,0.173950

In [32]:
newdf

            0         1         2         3         4
0    0.227120  0.158776  0.582800  0.976776  0.935772
1    0.464585  0.425828  0.174388  0.342861  0.243760
2    0.320174  0.260614  0.973324  0.567415  0.757848
3    0.341247  0.569940  0.366893  0.892741  0.586503
4    0.894240  0.975039  0.302874  0.576635  0.523117
..        ...       ...       ...       ...       ...
329  0.686348  0.269655  0.386175  0.495520  0.589684
330  0.763125  0.246915  0.326172  0.406805  0.022943
331  0.354866  0.083360  0.722699  0.614485  0.844249
332  0.934848  0.746668  0.843943  0.885472  0.623131
333  0.884062  0.323589  0.387717  0.523655  0.173950

[334 rows x 5 columns]

In [33]:
newdf.head()

          0         1         2         3         4
0  0.227120  0.158776  0.582800  0.976776  0.935772
1  0.464585  0.425828  0.174388  0.342861  0.243760
2  0.320174  0.260614  0.973324  0.567415  0.757848
3  0.341247  0.569940  0.366893  0.892741  0.586503
4  0.894240  0.975039  0.302874  0.576635  0.523117

In [37]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.884062  0.323589  0.387717  0.523655  0.173950
332  0.934848  0.746668  0.843943  0.885472  0.623131
331  0.354866  0.083360  0.722699  0.614485  0.844249
330  0.763125  0.246915  0.326172  0.406805  0.022943
329  0.686348  0.269655  0.386175  0.495520  0.589684
..        ...       ...       ...       ...       ...
4    0.894240  0.975039  0.302874  0.576635  0.523117
3    0.341247  0.569940  0.366893  0.892741  0.586503
2    0.320174  0.260614  0.973324  0.567415  0.757848
1    0.464585  0.425828  0.174388  0.342861  0.243760
0    0.227120  0.158776  0.582800  0.976776  0.935772

[334 rows x 5 columns]

In [38]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.935772  0.976776  0.582800  0.158776  0.227120
1    0.243760  0.342861  0.174388  0.425828  0.464585
2    0.757848  0.567415  0.973324  0.260614  0.320174
3    0.586503  0.892741  0.366893  0.569940  0.341247
4    0.523117  0.576635  0.302874  0.975039  0.894240
..        ...       ...       ...       ...       ...
329  0.589684  0.495520  0.386175  0.269655  0.686348
330  0.022943  0.406805  0.326172  0.246915  0.763125
331  0.844249  0.614485  0.722699  0.083360  0.354866
332  0.623131  0.885472  0.843943  0.746668  0.934848
333  0.173950  0.523655  0.387717  0.323589  0.884062

[334 rows x 5 columns]

In [39]:
newdf.head()

          0         1         2         3         4
0  0.227120  0.158776  0.582800  0.976776  0.935772
1  0.464585  0.425828  0.174388  0.342861  0.243760
2  0.320174  0.260614  0.973324  0.567415  0.757848
3  0.341247  0.569940  0.366893  0.892741  0.586503
4  0.894240  0.975039  0.302874  0.576635  0.523117

In [40]:
type(newdf[0])

pandas.core.series.Series

In [41]:
newdf1= newdf

In [42]:
newdf1[0][0] = 0.11

In [43]:
newdf, newdf1

(            0         1         2         3         4
 0    0.110000  0.158776  0.582800  0.976776  0.935772
 1    0.464585  0.425828  0.174388  0.342861  0.243760
 2    0.320174  0.260614  0.973324  0.567415  0.757848
 3    0.341247  0.569940  0.366893  0.892741  0.586503
 4    0.894240  0.975039  0.302874  0.576635  0.523117
 ..        ...       ...       ...       ...       ...
 329  0.686348  0.269655  0.386175  0.495520  0.589684
 330  0.763125  0.246915  0.326172  0.406805  0.022943
 331  0.354866  0.083360  0.722699  0.614485  0.844249
 332  0.934848  0.746668  0.843943  0.885472  0.623131
 333  0.884062  0.323589  0.387717  0.523655  0.173950

 [334 rows x 5 columns],
             0         1         2         3         4
 0    0.110000  0.158776  0.582800  0.976776  0.935772
 1    0.464585  0.425828  0.174388  0.342861  0.243760
 2    0.320174  0.260614  0.973324  0.567415  0.757848
 3    0.341247  0.569940  0.366893  0.892741  0.586503
 4    0.894240  0.975039  0.302874  0.576635  0.523117
 ..        ...       ...       ...       ...       ...
 329  0.686348  0.269655  0.386175  0.495520  0.589684
 330  0.763125  0.246915  0.326172  0.406805  0.022943
 331  0.354866  0.083360  0.722699  0.614485  0.844249
 332  0.934848  0.746668  0.843943  0.885472  0.623131
 333  0.884062  0.323589  0.387717  0.523655  0.173950

 [334 rows x 5 columns])

In [44]:
newdf1 = newdf.copy()

In [45]:
newdf.loc[0,0]=13

In [46]:
newdf

             0         1         2         3         4
0    13.000000  0.158776  0.582800  0.976776  0.935772
1     0.464585  0.425828  0.174388  0.342861  0.243760
2     0.320174  0.260614  0.973324  0.567415  0.757848
3     0.341247  0.569940  0.366893  0.892741  0.586503
4     0.894240  0.975039  0.302874  0.576635  0.523117
..         ...       ...       ...       ...       ...
329   0.686348  0.269655  0.386175  0.495520  0.589684
330   0.763125  0.246915  0.326172  0.406805  0.022943
331   0.354866  0.083360  0.722699  0.614485  0.844249
332   0.934848  0.746668  0.843943  0.885472  0.623131
333   0.884062  0.323589  0.387717  0.523655  0.173950

[334 rows x 5 columns]

In [47]:
newdf.columns = list("ABCDE")

In [48]:
newdf.head()

           A         B         C         D         E
0  13.000000  0.158776  0.582800  0.976776  0.935772
1   0.464585  0.425828  0.174388  0.342861  0.243760
2   0.320174  0.260614  0.973324  0.567415  0.757848
3   0.341247  0.569940  0.366893  0.892741  0.586503
4   0.894240  0.975039  0.302874  0.576635  0.523117

In [51]:
newdf['A'][0]

13.0

In [52]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.174388  0.342861
2  0.973324  0.567415

In [53]:
newdf.head()

           A         B         C         D         E
0  13.000000  0.158776  0.582800  0.976776  0.935772
1   0.464585  0.425828  0.174388  0.342861  0.243760
2   0.320174  0.260614  0.973324  0.567415  0.757848
3   0.341247  0.569940  0.366893  0.892741  0.586503
4   0.894240  0.975039  0.302874  0.576635  0.523117

In [54]:
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.464585  0.425828  0.174388  0.342861  0.243760
2  0.320174  0.260614  0.973324  0.567415  0.757848

In [55]:
newdf.loc[:,['A','B']]

             A         B
0    13.000000  0.158776
1     0.464585  0.425828
2     0.320174  0.260614
3     0.341247  0.569940
4     0.894240  0.975039
..         ...       ...
329   0.686348  0.269655
330   0.763125  0.246915
331   0.354866  0.083360
332   0.934848  0.746668
333   0.884062  0.323589

[334 rows x 2 columns]

In [56]:
newdf.loc[(newdf['A']<0.3)]

            A         B         C         D         E
5    0.289646  0.175056  0.300442  0.706429  0.996730
8    0.028671  0.191519  0.047662  0.659239  0.813684
11   0.098538  0.860286  0.061599  0.865411  0.593319
16   0.153422  0.907804  0.003561  0.278585  0.752766
20   0.195756  0.056185  0.723415  0.190044  0.827725
..        ...       ...       ...       ...       ...
310  0.188969  0.113087  0.948220  0.526252  0.848718
319  0.064778  0.926099  0.336378  0.405967  0.705917
320  0.107782  0.361766  0.061715  0.898871  0.564677
321  0.286490  0.332978  0.420244  0.209577  0.807727
328  0.258550  0.120575  0.669169  0.376014  0.717611

[107 rows x 5 columns]

In [57]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
5    0.289646  0.175056  0.300442  0.706429  0.996730
20   0.195756  0.056185  0.723415  0.190044  0.827725
23   0.184612  0.430568  0.185573  0.217380  0.200335
26   0.005254  0.236314  0.749148  0.218560  0.374284
32   0.209662  0.801164  0.375726  0.026665  0.430167
..        ...       ...       ...       ...       ...
301  0.196599  0.515639  0.388774  0.786709  0.212876
310  0.188969  0.113087  0.948220  0.526252  0.848718
319  0.064778  0.926099  0.336378  0.405967  0.705917
321  0.286490  0.332978  0.420244  0.209577  0.807727
328  0.258550  0.120575  0.669169  0.376014  0.717611

[91 rows x 5 columns]

In [58]:
 newdf.head()

           A         B         C         D         E
0  13.000000  0.158776  0.582800  0.976776  0.935772
1   0.464585  0.425828  0.174388  0.342861  0.243760
2   0.320174  0.260614  0.973324  0.567415  0.757848
3   0.341247  0.569940  0.366893  0.892741  0.586503
4   0.894240  0.975039  0.302874  0.576635  0.523117

In [59]:
newdf.iloc[0,4]

0.9357718791205718

In [60]:
newdf.iloc[1,3]

0.3428609035417406

In [61]:
newdf.head(3)

           A         B         C         D         E
0  13.000000  0.158776  0.582800  0.976776  0.935772
1   0.464585  0.425828  0.174388  0.342861  0.243760
2   0.320174  0.260614  0.973324  0.567415  0.757848

In [62]:
newdf.drop(0)

            A         B         C         D         E
1    0.464585  0.425828  0.174388  0.342861  0.243760
2    0.320174  0.260614  0.973324  0.567415  0.757848
3    0.341247  0.569940  0.366893  0.892741  0.586503
4    0.894240  0.975039  0.302874  0.576635  0.523117
5    0.289646  0.175056  0.300442  0.706429  0.996730
..        ...       ...       ...       ...       ...
329  0.686348  0.269655  0.386175  0.495520  0.589684
330  0.763125  0.246915  0.326172  0.406805  0.022943
331  0.354866  0.083360  0.722699  0.614485  0.844249
332  0.934848  0.746668  0.843943  0.885472  0.623131
333  0.884062  0.323589  0.387717  0.523655  0.173950

[333 rows x 5 columns]

In [63]:
newdf.head()

           A         B         C         D         E
0  13.000000  0.158776  0.582800  0.976776  0.935772
1   0.464585  0.425828  0.174388  0.342861  0.243760
2   0.320174  0.260614  0.973324  0.567415  0.757848
3   0.341247  0.569940  0.366893  0.892741  0.586503
4   0.894240  0.975039  0.302874  0.576635  0.523117

In [64]:
newdf.drop('A', axis=1)

            B         C         D         E
0    0.158776  0.582800  0.976776  0.935772
1    0.425828  0.174388  0.342861  0.243760
2    0.260614  0.973324  0.567415  0.757848
3    0.569940  0.366893  0.892741  0.586503
4    0.975039  0.302874  0.576635  0.523117
..        ...       ...       ...       ...
329  0.269655  0.386175  0.495520  0.589684
330  0.246915  0.326172  0.406805  0.022943
331  0.083360  0.722699  0.614485  0.844249
332  0.746668  0.843943  0.885472  0.623131
333  0.323589  0.387717  0.523655  0.173950

[334 rows x 4 columns]

In [65]:
newdf.drop('A', axis=1, inplace=True)

In [66]:
newdf

            B         C         D         E
0    0.158776  0.582800  0.976776  0.935772
1    0.425828  0.174388  0.342861  0.243760
2    0.260614  0.973324  0.567415  0.757848
3    0.569940  0.366893  0.892741  0.586503
4    0.975039  0.302874  0.576635  0.523117
..        ...       ...       ...       ...
329  0.269655  0.386175  0.495520  0.589684
330  0.246915  0.326172  0.406805  0.022943
331  0.083360  0.722699  0.614485  0.844249
332  0.746668  0.843943  0.885472  0.623131
333  0.323589  0.387717  0.523655  0.173950

[334 rows x 4 columns]

In [67]:
newdf

            B         C         D         E
0    0.158776  0.582800  0.976776  0.935772
1    0.425828  0.174388  0.342861  0.243760
2    0.260614  0.973324  0.567415  0.757848
3    0.569940  0.366893  0.892741  0.586503
4    0.975039  0.302874  0.576635  0.523117
..        ...       ...       ...       ...
329  0.269655  0.386175  0.495520  0.589684
330  0.246915  0.326172  0.406805  0.022943
331  0.083360  0.722699  0.614485  0.844249
332  0.746668  0.843943  0.885472  0.623131
333  0.323589  0.387717  0.523655  0.173950

[334 rows x 4 columns]

In [68]:
newdf.head()

          B         C         D         E
0  0.158776  0.582800  0.976776  0.935772
1  0.425828  0.174388  0.342861  0.243760
2  0.260614  0.973324  0.567415  0.757848
3  0.569940  0.366893  0.892741  0.586503
4  0.975039  0.302874  0.576635  0.523117

In [71]:
# create dataframe which contains only integers with 3 rows and 2 cols 
# run basic stat analysis methods
import pandas as pd
data = [[10,11],[12,13],[14,15]]
df = pd.DataFrame(data, columns=['A','B'])

In [72]:
df

    A   B
0  10  11
1  12  13
2  14  15

In [73]:
df.describe()

          A     B
count   3.0   3.0
mean   12.0  13.0
std     2.0   2.0
min    10.0  11.0
25%    11.0  12.0
50%    12.0  13.0
75%    13.0  14.0
max    14.0  15.0

In [74]:
df.mean()

A    12.0
B    13.0
dtype: float64

In [75]:
df.corr()

     A    B
A  1.0  1.0
B  1.0  1.0

In [76]:
df.count()

A    3
B    3
dtype: int64

In [77]:
df.max()

A    14
B    15
dtype: int64

In [78]:
df.min()

A    10
B    11
dtype: int64

In [79]:
df.median()

A    12.0
B    13.0
dtype: float64

In [80]:
df.std()

A    2.0
B    2.0
dtype: float64

In [81]:
df

    A   B
0  10  11
1  12  13
2  14  15